gdgly/NUC97X_JS/STM32F4xx/DL698/RM_Event_DL2007.c

#include "Project698.h"
#include "../DL698/DL698_DataDef.h"
#include "../DL698/RM_Event_DL2007.h"
#include "../DL698/RM_RxDATA.h"
#include "../STM32F4xx/STM32F4xx_UART.h"
#include "../Device/MEMRW.h"
#include "../Calculate/Calculate.h"



typedef __packed struct
{
	u32 OAD;//对应698数据的关联OAD
	u8 DataType;//对应698的数据类型
	u8 offset;//在DL645-2007返回帧中数据标识后开始的偏移字节数
	u8 byte;//在DL645-2007返回帧中有效字节数
}RM_Event_DL2007_DATAOAD_typedef;

typedef __packed struct
{
	u32 OAD;//对应698事件的OAD
	u32 DI_NUM;//对应DL645-2007事件发生次数的抄读标识,0=空
	u32 DI_TIME;//对应DL645-2007事件累计时间的抄读标识,0=空
	u32 DI_LASTEVENT1;//对应DL645-2007最近1次事件的抄读标识1,0=空
	u32 DI_LASTEVENT2;//对应DL645-2007最近1次事件的抄读标识2,0=空
	u8 NUM_OAD1;//抄读标识1关联数据OAD个数
	u8 NUM_OAD2;//抄读标识2关联数据OAD个数
	RM_Event_DL2007_DATAOAD_typedef   DATAOAD[64];
}RM_Event_DL2007_typedef;


//B0负荷开关误动或拒动
__align(4) const RM_Event_DL2007_typedef RM_Event_DL2007_302B[]=//B0负荷开关误动或拒动
{
	0x302B0200,//对应698事件的OAD
	0x03360000,//对应DL645-2007事件发生次数的抄读标识,0=空
	0,//对应DL645-2007事件累计时间的抄读标识,0=空
	0x03360001,//对应DL645-2007最近1次事件的抄读标识1,0=空
	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
	
	8,//抄读标识1关联数据OAD个数
	0,//抄读标识2关联数据OAD个数
//1事件记录序号(总是排在第一个)
	0x20220200,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	3,//在DL645-2007返回帧中有效字节数
//2事件发生时间
	0x201E0200,//对应698数据的关联OAD
	DataType_date_time_s,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	6,//在DL645-2007返回帧中有效字节数
//3事件结束时间
	0x20200200,//对应698数据的关联OAD
	DataType_date_time_s,//对应698的数据类型
	6,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	6,//在DL645-2007返回帧中有效字节数
//4负荷开关误动作时状态
	0xF2050201,//对应698数据的关联OAD
	DataType_Data,//对应698的数据类型
	12,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	1,//在DL645-2007返回帧中有效字节数
//5负荷开关误动作前正向有功总电能
	0x00102201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	13,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//6负荷开关误动作前反向有功总电能
	0x00202201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	17,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//7负荷开关误动作后正向有功总电能
	0x00108201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	21,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//8负荷开关误动作后反向有功总电能
	0x00208201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	25,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
};

////B1 ESAM错误
////B2 内卡初始化错误	
////B3 时钟电池电压低
////B4 内部程序错误
////B5 存储器故障或损坏
////B6 保留
////B7 时钟故障
////B8 停电抄表电池欠压
////B9 透支状态
//	
////B10开表盖
//	10,//对应DL645-2007主动上报状态字中的位B0-B95
//	0x301B0200,//对应事件的OAD
//	0x03300D00,//对应DL645-2007事件发生次数的抄读标识,0=空
//	0,//对应DL645-2007事件累计时间的抄读标识,0=空
//	0x03300D01,//对应DL645-2007最近1次事件的抄读标识,0=空
//	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
__align(4) const RM_Event_DL2007_typedef RM_Event_DL2007_301B[]=//B10开表盖
{
	0x301B0200,//对应698事件的OAD
	0x03300D00,//对应DL645-2007事件发生次数的抄读标识,0=空
	0,//对应DL645-2007事件累计时间的抄读标识,0=空
	0x03300D01,//对应DL645-2007最近1次事件的抄读标识1,0=空
	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
	
	15,//抄读标识1关联数据OAD个数
	0,//抄读标识2关联数据OAD个数
//1事件记录序号(总是排在第一个)
	0x20220200,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	3,//在DL645-2007返回帧中有效字节数
//2事件发生时间
	0x201E0200,//对应698数据的关联OAD
	DataType_date_time_s,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	6,//在DL645-2007返回帧中有效字节数
//3事件结束时间
	0x20200200,//对应698数据的关联OAD
	DataType_date_time_s,//对应698的数据类型
	6,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	6,//在DL645-2007返回帧中有效字节数
//4开表盖前正向有功总电能
	0x00102201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	12,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//5开表盖前反向有功总电能
	0x00202201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	16,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//6开表盖前第一象限无功总电能
	0x00502201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	20,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//7开表盖前第二象限无功总电能
	0x00602201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	24,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//8开表盖前第三象限无功总电能
	0x00702201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	28,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数	
//9开表盖前第四象限无功总电能
	0x00802201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	32,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数	
//10开表盖后正向有功总电能
	0x00108201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	36,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//11开表盖后反向有功总电能
	0x00208201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	40,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//12开表盖后第一象限无功总电能
	0x00508201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	44,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//13开表盖后第二象限无功总电能
	0x00608201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	48,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//14开表盖后第三象限无功总电能
	0x00708201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	52,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数	
//15开表盖前第四象限无功总电能
	0x00808201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	56,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数	
};

////B11开端钮盖
//	11,//对应DL645-2007主动上报状态字中的位B0-B95
//	0x301C0200,//对应事件的OAD
//	0x03300E00,//对应DL645-2007事件发生次数的抄读标识,0=空
//	0,//对应DL645-2007事件累计时间的抄读标识,0=空
//	0x03300E01,//对应DL645-2007最近1次事件的抄读标识,0=空
//	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
__align(4) const RM_Event_DL2007_typedef RM_Event_DL2007_301C[]=//B11开端钮盖
{
	0x301C0200,//对应698事件的OAD
	0x03300E00,//对应DL645-2007事件发生次数的抄读标识,0=空
	0,//对应DL645-2007事件累计时间的抄读标识,0=空
	0x03300E01,//对应DL645-2007最近1次事件的抄读标识1,0=空
	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
	
	15,//抄读标识1关联数据OAD个数
	0,//抄读标识2关联数据OAD个数
//1事件记录序号(总是排在第一个)
	0x20220200,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	3,//在DL645-2007返回帧中有效字节数
//2事件发生时间
	0x201E0200,//对应698数据的关联OAD
	DataType_date_time_s,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	6,//在DL645-2007返回帧中有效字节数
//3事件结束时间
	0x20200200,//对应698数据的关联OAD
	DataType_date_time_s,//对应698的数据类型
	6,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	6,//在DL645-2007返回帧中有效字节数
//4开端钮盖前正向有功总电能
	0x00102201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	12,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//5开端钮盖前反向有功总电能
	0x00202201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	16,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//6开端钮盖前第一象限无功总电能
	0x00502201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	20,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//7开端钮盖前第二象限无功总电能
	0x00602201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	24,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//8开端钮盖前第三象限无功总电能
	0x00702201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	28,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数	
//9开端钮盖前第四象限无功总电能
	0x00802201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	32,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数	
//10开端钮盖后正向有功总电能
	0x00108201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	36,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//11开端钮盖后反向有功总电能
	0x00208201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	40,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//12开端钮盖后第一象限无功总电能
	0x00508201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	44,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//13开端钮盖后第二象限无功总电能
	0x00608201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	48,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//14开端钮盖后第三象限无功总电能
	0x00708201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	52,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数	
//15开端钮盖前第四象限无功总电能
	0x00808201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	56,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数	
};

////B12恒定磁场干扰	
//	12,//对应DL645-2007主动上报状态字中的位B0-B95
//	0x302A0200,//对应事件的OAD
//	0x03350000,//对应DL645-2007事件发生次数的抄读标识,0=空
//	0,//对应DL645-2007事件累计时间的抄读标识,0=空
//	0x03350001,//对应DL645-2007最近1次事件的抄读标识,0=空
//	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
__align(4) const RM_Event_DL2007_typedef RM_Event_DL2007_302A[]=//B12恒定磁场干扰	
{
	0x302A0200,//对应事件的OAD
	0x03350000,//对应DL645-2007事件发生次数的抄读标识,0=空
	0,//对应DL645-2007事件累计时间的抄读标识,0=空
	0x03350001,//对应DL645-2007最近1次事件的抄读标识,0=空
	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
	
	7,//抄读标识1关联数据OAD个数
	0,//抄读标识2关联数据OAD个数
//1事件记录序号(总是排在第一个)
	0x20220200,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	3,//在DL645-2007返回帧中有效字节数
//2事件发生时间
	0x201E0200,//对应698数据的关联OAD
	DataType_date_time_s,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	6,//在DL645-2007返回帧中有效字节数
//3事件结束时间
	0x20200200,//对应698数据的关联OAD
	DataType_date_time_s,//对应698的数据类型
	6,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	6,//在DL645-2007返回帧中有效字节数
//4恒定磁场干扰事件前正向有功总电能
	0x00102201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	12,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//5恒定磁场干扰事件前反向有功总电能
	0x00202201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	16,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//6恒定磁场干扰事件后正向有功总电能
	0x00108201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	20,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//7恒定磁场干扰事件后反向有功总电能
	0x00208201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	24,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
};

////B13电源异常
//	13,//对应DL645-2007主动上报状态字中的位B0-B95
//	0x302C0200,//对应事件的OAD
//	0x03370000,//对应DL645-2007事件发生次数的抄读标识,0=空
//	0,//对应DL645-2007事件累计时间的抄读标识,0=空
//	0x03370001,//对应DL645-2007最近1次事件的抄读标识,0=空
//	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
__align(4) const RM_Event_DL2007_typedef RM_Event_DL2007_302C[]=//B13电源异常
{
	0x302C0200,//对应事件的OAD
	0x03370000,//对应DL645-2007事件发生次数的抄读标识,0=空
	0,//对应DL645-2007事件累计时间的抄读标识,0=空
	0x03370001,//对应DL645-2007最近1次事件的抄读标识,0=空
	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
	
	5,//抄读标识1关联数据OAD个数
	0,//抄读标识2关联数据OAD个数
//1事件记录序号(总是排在第一个)
	0x20220200,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	3,//在DL645-2007返回帧中有效字节数
//2事件发生时间
	0x201E0200,//对应698数据的关联OAD
	DataType_date_time_s,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	6,//在DL645-2007返回帧中有效字节数
//3事件结束时间
	0x20200200,//对应698数据的关联OAD
	DataType_date_time_s,//对应698的数据类型
	6,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	6,//在DL645-2007返回帧中有效字节数
//4电源异常发生时刻正向有功总电能
	0x00102201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	12,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//5电源异常发生时刻反向有功总电能
	0x00202201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	16,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
};

////B14跳闸成功
//	14,//对应DL645-2007主动上报状态字中的位B0-B95
//	0x301F0200,//对应事件的OAD
//	0x1D000001,//对应DL645-2007事件发生次数的抄读标识,0=空
//	0,//对应DL645-2007事件累计时间的抄读标识,0=空
//	0x1D000101,//对应DL645-2007最近1次事件的抄读标识,0=空
//	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
__align(4) const RM_Event_DL2007_typedef RM_Event_DL2007_301F[]=//B14跳闸成功
{
	0x301F0200,//对应事件的OAD
	0x1D000001,//对应DL645-2007事件发生次数的抄读标识,0=空
	0,//对应DL645-2007事件累计时间的抄读标识,0=空
	0x1D000101,//对应DL645-2007最近1次事件的抄读标识,0=空
	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
	
	9,//抄读标识1关联数据OAD个数
	0,//抄读标识2关联数据OAD个数
//1事件记录序号(总是排在第一个)
	0x20220200,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	3,//在DL645-2007返回帧中有效字节数
//2事件发生时间
	0x201E0200,//对应698数据的关联OAD
	DataType_date_time_s,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	6,//在DL645-2007返回帧中有效字节数
//3事件结束时间
	0x20200200,//对应698数据的关联OAD
	DataType_date_time_s,//对应698的数据类型
	6,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	0,//在DL645-2007返回帧中有效字节数
//4跳闸时正向有功总电能
	0x00102201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	10,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//5跳闸时反向有功总电能
	0x00202201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	14,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//6跳闸时第一象限无功总电能
	0x00502201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	18,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//7跳闸时第二象限无功总电能
	0x00602201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	22,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//8跳闸时第三象限无功总电能
	0x00702201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	26,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//9跳闸时第四象限无功总电能
	0x00802201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	30,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
};
////B15合闸成功
//	15,//对应DL645-2007主动上报状态字中的位B0-B95
//	0x30200200,//对应事件的OAD
//	0x1E000001,//对应DL645-2007事件发生次数的抄读标识,0=空
//	0,//对应DL645-2007事件累计时间的抄读标识,0=空
//	0x1E000101,//对应DL645-2007最近1次事件的抄读标识,0=空
//	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
__align(4) const RM_Event_DL2007_typedef RM_Event_DL2007_3020[]=//B15合闸成功
{
	0x30200200,//对应事件的OAD
	0x1E000001,//对应DL645-2007事件发生次数的抄读标识,0=空
	0,//对应DL645-2007事件累计时间的抄读标识,0=空
	0x1E000101,//对应DL645-2007最近1次事件的抄读标识,0=空
	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
	
	9,//抄读标识1关联数据OAD个数
	0,//抄读标识2关联数据OAD个数
//1事件记录序号(总是排在第一个)
	0x20220200,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	3,//在DL645-2007返回帧中有效字节数
//2事件发生时间
	0x201E0200,//对应698数据的关联OAD
	DataType_date_time_s,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	6,//在DL645-2007返回帧中有效字节数
//3事件结束时间
	0x20200200,//对应698数据的关联OAD
	DataType_date_time_s,//对应698的数据类型
	6,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	0,//在DL645-2007返回帧中有效字节数
//4合闸时正向有功总电能
	0x00102201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	10,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//5合闸时反向有功总电能
	0x00202201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	14,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//6合闸时第一象限无功总电能
	0x00502201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	18,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//7合闸时第二象限无功总电能
	0x00602201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	22,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//8合闸时第三象限无功总电能
	0x00702201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	26,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//9合闸时第四象限无功总电能
	0x00802201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	30,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
};
////B16 A相失压
//	16,//对应DL645-2007主动上报状态字中的位B0-B95
//	0x30000700,//对应事件的OAD
//	0x10010001,//对应DL645-2007事件发生次数的抄读标识,0=空
//	0,//对应DL645-2007事件累计时间的抄读标识,0=空
//	0x10010101,//对应DL645-2007最近1次事件的抄读标识,0=空
//	0x10012501,//对应DL645-2007最近1次事件的抄读标识2,0=空
__align(4) const RM_Event_DL2007_typedef RM_Event_DL2007_30000700[]=//B16 A相失压
{
	0x30000700,//对应事件的OAD
	0x10010001,//对应DL645-2007事件发生次数的抄读标识,0=空
	0,//对应DL645-2007事件累计时间的抄读标识,0=空
	0x1001FF01,//对应DL645-2007最近1次事件的抄读标识,0=空
	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
	
