gdgly/NUC97X_JS/STM32F4xx/DL698/RM_Event_DL2007.c
////B33 B相欠压
//	33,//对应DL645-2007主动上报状态字中的位B0-B95
//	0x30010800,//对应事件的OAD
//	0x11020001,//对应DL645-2007事件发生次数的抄读标识,0=空
//	0,//对应DL645-2007事件累计时间的抄读标识,0=空
//	0x11020101,//对应DL645-2007最近1次事件的抄读标识,0=空
//	0x11022501,//对应DL645-2007最近1次事件的抄读标识2,0=空
__align(4) const RM_Event_DL2007_typedef RM_Event_DL2007_30010800[]=//B33 B相欠压
{
	0x30010800,//对应事件的OAD
	0x11020001,//对应DL645-2007事件发生次数的抄读标识,0=空
	0,//对应DL645-2007事件累计时间的抄读标识,0=空
	0x1102FF01,//对应DL645-2007最近1次事件的抄读标识,0=空
	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
	
	54,//抄读标识1关联数据OAD个数
	0,//抄读标识2关联数据OAD个数
//1事件记录序号(总是排在第一个)
	0x20220200,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	3,//在DL645-2007返回帧中有效字节数
//2事件发生时间
	0x201E0200,//对应698数据的关联OAD
	DataType_date_time_s,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	6,//在DL645-2007返回帧中有效字节数
//3事件发生时刻正向有功总电能
	0x00102201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	6,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//4事件发生时刻反向有功总电能
	0x00202201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	10,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//5事件发生时刻组合无功1总电能
	0x00302201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	14,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//6事件发生时刻组合无功2总电能
	0x00402201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	18,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//7事件发生时刻A相正向有功电能
	0x00112201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	22,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//8事件发生时刻A相反向有功电能
	0x00212201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	26,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//9事件发生时刻A相组合无功1电能
	0x00312201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	30,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//10事件发生时刻A相组合无功2电能
	0x00412201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	34,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//11事件发生时刻A相电压
	0x20002201,//对应698数据的关联OAD
	DataType_long_unsigned,//对应698的数据类型
	38,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	2,//在DL645-2007返回帧中有效字节数
//12事件发生时刻A相电流
	0x20012201,//对应698数据的关联OAD
	DataType_double_long,//对应698的数据类型
	40,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	3,//在DL645-2007返回帧中有效字节数
//13事件发生时刻A相有功功率
	0x20042202,//对应698数据的关联OAD
	DataType_double_long,//对应698的数据类型
	43,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	3,//在DL645-2007返回帧中有效字节数
//14事件发生时刻A相无功功率
	0x20052202,//对应698数据的关联OAD
	DataType_double_long,//对应698的数据类型
	46,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	3,//在DL645-2007返回帧中有效字节数
//15事件发生时刻A相功率因数
	0x200A2202,//对应698数据的关联OAD
	DataType_long,//对应698的数据类型
	49,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	2,//在DL645-2007返回帧中有效字节数
//16事件发生时刻发生时刻B相正向有功电能
	0x00122201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	51,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//17事件发生时刻B相反向有功电能	
	0x00222201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	55,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//18事件发生时刻B相组合无功1电能	
	0x00322201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	59,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//19事件发生时刻B相组合无功2电能	
	0x00422201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	63,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//20事件发生时刻B相电压
	0x20002202,//对应698数据的关联OAD
	DataType_long_unsigned,//对应698的数据类型
	67,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	2,//在DL645-2007返回帧中有效字节数
//21事件发生时刻B相电流
	0x20012202,//对应698数据的关联OAD
	DataType_double_long,//对应698的数据类型
	69,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	3,//在DL645-2007返回帧中有效字节数
//22事件发生时刻B相有功功率
	0x20042203,//对应698数据的关联OAD
	DataType_double_long,//对应698的数据类型
	72,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	3,//在DL645-2007返回帧中有效字节数
//23事件发生时刻B相无功功率
	0x20052203,//对应698数据的关联OAD
	DataType_double_long,//对应698的数据类型
	75,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	3,//在DL645-2007返回帧中有效字节数
//24事件发生时刻B相功率因数
	0x200A2203,//对应698数据的关联OAD
	DataType_long,//对应698的数据类型
	78,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	2,//在DL645-2007返回帧中有效字节数
//25事件发生时刻发生时刻C相正向有功电能
	0x00132201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	80,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//26事件发生时刻C相反向有功电能	
	0x00232201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	84,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//27事件发生时刻C相组合无功1电能	
	0x00332201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	88,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//28事件发生时刻C相组合无功2电能	
	0x00432201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	92,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//29事件发生时刻C相电压
	0x20002203,//对应698数据的关联OAD
	DataType_long_unsigned,//对应698的数据类型
	96,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	2,//在DL645-2007返回帧中有效字节数
//30事件发生时刻C相电流
	0x20012203,//对应698数据的关联OAD
	DataType_double_long,//对应698的数据类型
	98,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	3,//在DL645-2007返回帧中有效字节数
//31事件发生时刻C相有功功率
	0x20042204,//对应698数据的关联OAD
	DataType_double_long,//对应698的数据类型
	101,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	3,//在DL645-2007返回帧中有效字节数
//32事件发生时刻C相无功功率
	0x20052204,//对应698数据的关联OAD
	DataType_double_long,//对应698的数据类型
	104,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	3,//在DL645-2007返回帧中有效字节数
//33事件发生时刻C相功率因数
	0x200A2204,//对应698数据的关联OAD
	DataType_long,//对应698的数据类型
	107,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	2,//在DL645-2007返回帧中有效字节数
//34事件发生期间总安时数
	0x20296200,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	109,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//35事件发生期间A相安时数
	0x20296200,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	113,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//36事件发生期间B相安时数
	0x20296200,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	117,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//37事件发生期间C相安时数
	0x20296200,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	121,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//38事件结束时刻
	0x20200200,//对应698数据的关联OAD
	DataType_date_time_s,//对应698的数据类型
	125,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	6,//在DL645-2007返回帧中有效字节数
//39事件结束时刻正向有功总电能
	0x00108201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	131,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//40事件结束时刻反向有功总电能
	0x00208201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	135,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//41事件结束时刻组合无功1总电能
	0x00308201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	139,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//42事件结束时刻组合无功2总电能
	0x00408201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	143,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//43事件结束时刻A相正向有功总电能
	0x00118201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	147,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//44事件结束时刻A相反向有功总电能
	0x00218201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	151,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//45事件结束时刻A相组合无功1总电能
	0x00318201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	155,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//46事件结束时刻A相组合无功2总电能
	0x00418201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	159,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//47事件结束时刻B相正向有功总电能
	0x00128201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	163,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//48事件结束时刻B相反向有功总电能
	0x00228201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	167,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//49事件结束时刻B相组合无功1总电能
	0x00328201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	171,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//50事件结束时刻B相组合无功2总电能
	0x00428201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	175,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//51事件结束时刻C相正向有功总电能
	0x00138201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	179,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//52事件结束时刻C相反向有功总电能
	0x00238201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	183,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//53事件结束时刻C相组合无功1总电能
	0x00338201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	187,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//54事件结束时刻C相组合无功2总电能
	0x00438201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	191,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
};

////B34 B相过压
//	34,//对应DL645-2007主动上报状态字中的位B0-B95
//	0x30020800,//对应事件的OAD
//	0x12020001,//对应DL645-2007事件发生次数的抄读标识,0=空
//	0,//对应DL645-2007事件累计时间的抄读标识,0=空
//	0x12020101,//对应DL645-2007最近1次事件的抄读标识,0=空
//	0x12022501,//对应DL645-2007最近1次事件的抄读标识2,0=空
__align(4) const RM_Event_DL2007_typedef RM_Event_DL2007_30020800[]=//B34 B相过压
{
	0x30020800,//对应事件的OAD
	0x12020001,//对应DL645-2007事件发生次数的抄读标识,0=空
	0,//对应DL645-2007事件累计时间的抄读标识,0=空
	0x1202FF01,//对应DL645-2007最近1次事件的抄读标识,0=空
	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
	
