gdgly/NUC97X_JS/STM32F4xx/DL698/RM_Event_DL2007.c
////B67电流不平衡
//	67,//对应DL645-2007主动上报状态字中的位B0-B95
//	0x301E0200,//对应事件的OAD
//	0x17000001,//对应DL645-2007事件发生次数的抄读标识,0=空
//	0,//对应DL645-2007事件累计时间的抄读标识,0=空
//	0x17000101,//对应DL645-2007最近1次事件的抄读标识,0=空
//	0x17001301,//对应DL645-2007最近1次事件的抄读标识2,0=空
__align(4) const RM_Event_DL2007_typedef RM_Event_DL2007_301E[]=//B67电流不平衡
{
	0x301E0200,//对应事件的OAD
	0x17000001,//对应DL645-2007事件发生次数的抄读标识,0=空
	0,//对应DL645-2007事件累计时间的抄读标识,0=空
	0x1700FF01,//对应DL645-2007最近1次事件的抄读标识,0=空
	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
	
	36,//抄读标识1关联数据OAD个数
	0,//抄读标识2关联数据OAD个数
//1事件记录序号(总是排在第一个)
	0x20220200,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	3,//在DL645-2007返回帧中有效字节数
//2事件发生时间
	0x201E0200,//对应698数据的关联OAD
	DataType_date_time_s,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	6,//在DL645-2007返回帧中有效字节数
//3事件发生时刻正向有功总电能
	0x00102201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	6,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//4事件发生时刻反向有功总电能
	0x00202201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	10,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//5事件发生时刻组合无功1总电能
	0x00302201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	14,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//6事件发生时刻组合无功2总电能
	0x00402201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	18,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//7事件发生时刻A相正向有功电能
	0x00112201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	22,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//8事件发生时刻A相反向有功电能
	0x00212201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	26,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//9事件发生时刻A相组合无功1电能
	0x00312201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	30,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//10事件发生时刻A相组合无功2电能
	0x00412201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	34,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//11事件发生时刻发生时刻B相正向有功电能
	0x00122201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	38,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//12事件发生时刻B相反向有功电能	
	0x00222201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	42,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//13事件发生时刻B相组合无功1电能	
	0x00322201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	46,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//14事件发生时刻B相组合无功2电能	
	0x00422201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	50,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//15事件发生时刻发生时刻C相正向有功电能
	0x00132201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	54,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//16事件发生时刻C相反向有功电能	
	0x00232201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	58,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//17事件发生时刻C相组合无功1电能	
	0x00332201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	62,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//18事件发生时刻C相组合无功2电能	
	0x00432201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	66,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//19事件发生时刻最大不平衡率	
	0x20266200,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	70,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	3,//在DL645-2007返回帧中有效字节数
//20事件结束时刻
	0x20200200,//对应698数据的关联OAD
	DataType_date_time_s,//对应698的数据类型
	73,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	6,//在DL645-2007返回帧中有效字节数
//21事件结束时刻正向有功总电能
	0x00108201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	79,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//22事件结束时刻反向有功总电能
	0x00208201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	83,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//23事件结束时刻组合无功1总电能
	0x00308201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	87,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//24事件结束时刻组合无功2总电能
	0x00408201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	91,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//25事件结束时刻A相正向有功总电能
	0x00118201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	95,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//26事件结束时刻A相反向有功总电能
	0x00218201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	99,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//27事件结束时刻A相组合无功1总电能
	0x00318201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	103,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//28事件结束时刻A相组合无功2总电能
	0x00418201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	107,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//29事件结束时刻B相正向有功总电能
	0x00128201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	111,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//30事件结束时刻B相反向有功总电能
	0x00228201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	115,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//31事件结束时刻B相组合无功1总电能
	0x00328201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	119,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//32事件结束时刻B相组合无功2总电能
	0x00428201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	123,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//33事件结束时刻C相正向有功总电能
	0x00138201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	127,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//34事件结束时刻C相反向有功总电能
	0x00238201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	131,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//35事件结束时刻C相组合无功1总电能
	0x00338201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	135,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//36事件结束时刻C相组合无功2总电能
	0x00438201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	139,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
};


