gdgly/NUC97X_JS/STM32F4xx/DL698/RM_Event_DL2007.c
////B73潮流反向(功率反向代)  ???有问题，功率反向是分 ABC相的 30070700 30070800 30070900
//	73,//对应DL645-2007主动上报状态字中的位B0-B95
//	0x30070200,//对应事件的OAD
//	0x21000000,//对应DL645-2007事件发生次数的抄读标识,0=空
//	0,//对应DL645-2007事件累计时间的抄读标识,0=空
//	0x21000001,//对应DL645-2007最近1次事件的抄读标识,0=空
//	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
__align(4) const RM_Event_DL2007_typedef RM_Event_DL2007_3007[]=//B73潮流反向(功率反向代) 
{
	0x30070200,//对应事件的OAD
	0x21000000,//对应DL645-2007事件发生次数的抄读标识,0=空
	0,//对应DL645-2007事件累计时间的抄读标识,0=空
	0x21000001,//对应DL645-2007最近1次事件的抄读标识,0=空
	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
	
	18,//抄读标识1关联数据OAD个数
	0,//抄读标识2关联数据OAD个数
//1事件记录序号(总是排在第一个)
	0x20220200,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	3,//在DL645-2007返回帧中有效字节数
//2事件发生时间
	0x201E0200,//对应698数据的关联OAD
	DataType_date_time_s,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	6,//在DL645-2007返回帧中有效字节数	
//事件发生时刻总有功功率方向（1字节）
//3事件发生时刻正向有功总电能
	0x00102201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	7,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//4事件发生时刻反向有功总电能
	0x00202201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	11,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//5事件发生时刻组合无功1总电能
	0x00302201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	15,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//6事件发生时刻组合无功2总电能
	0x00402201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	19,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//7事件发生时刻A相正向有功电能
	0x00112201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	23,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//8事件发生时刻A相反向有功电能
	0x00212201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	27,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//9事件发生时刻A相组合无功1电能
	0x00312201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	31,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//10事件发生时刻A相组合无功2电能
	0x00412201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	35,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//11事件发生时刻发生时刻B相正向有功电能
	0x00122201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	39,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//12事件发生时刻B相反向有功电能	
	0x00222201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	43,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//13事件发生时刻B相组合无功1电能	
	0x00322201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	47,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//14事件发生时刻B相组合无功2电能	
	0x00422201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	51,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//15事件发生时刻发生时刻C相正向有功电能
	0x00132201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	55,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//16事件发生时刻C相反向有功电能	
	0x00232201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	59,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//17事件发生时刻C相组合无功1电能	
	0x00332201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	63,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//18事件发生时刻C相组合无功2电能	
	0x00432201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	67,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
};

////B74全失压
//	74,//对应DL645-2007主动上报状态字中的位B0-B95
//	0x300D0200,//对应事件的OAD
//	0x03050000,//对应DL645-2007事件发生次数的抄读标识,0=空
//	0,//对应DL645-2007事件累计时间的抄读标识,0=空
//	0x03050001,//对应DL645-2007最近1次事件的抄读标识,0=空
//	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
__align(4) const RM_Event_DL2007_typedef RM_Event_DL2007_300D[]=//B74全失压 
{
	0x300D0200,//对应事件的OAD
	0x03050000,//对应DL645-2007事件发生次数的抄读标识,0=空
	0,//对应DL645-2007事件累计时间的抄读标识,0=空
	0x03050001,//对应DL645-2007最近1次事件的抄读标识,0=空
	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
	
	4,//抄读标识1关联数据OAD个数
	0,//抄读标识2关联数据OAD个数
//1事件记录序号(总是排在第一个)
	0x20220200,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	3,//在DL645-2007返回帧中有效字节数
//2事件发生时间
	0x201E0200,//对应698数据的关联OAD
	DataType_date_time_s,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	6,//在DL645-2007返回帧中有效字节数	
//3事件发生前电流
	0x20012200,//对应698数据的关联OAD
	DataType_double_long,//对应698的数据类型
	6,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	3,//在DL645-2007返回帧中有效字节数
//4事件结束时间
	0x20200200,//对应698数据的关联OAD
	DataType_date_time_s,//对应698的数据类型
	9,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	6,//在DL645-2007返回帧中有效字节数
};

//	
////B80编程
//	80,//对应DL645-2007主动上报状态字中的位B0-B95
//	0x30120200,//对应事件的OAD
//	0x03300000,//对应DL645-2007事件发生次数的抄读标识,0=空
//	0,//对应DL645-2007事件累计时间的抄读标识,0=空
//	0x03300001,//对应DL645-2007最近1次事件的抄读标识,0=空
//	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
__align(4) const RM_Event_DL2007_typedef RM_Event_DL2007_3012[]=//B80编程 
{
	0x30120200,//对应事件的OAD
	0x03300000,//对应DL645-2007事件发生次数的抄读标识,0=空
	0,//对应DL645-2007事件累计时间的抄读标识,0=空
	0x03300001,//对应DL645-2007最近1次事件的抄读标识,0=空
	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
	
	2,//抄读标识1关联数据OAD个数
	0,//抄读标识2关联数据OAD个数
//1事件记录序号(总是排在第一个)
	0x20220200,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	3,//在DL645-2007返回帧中有效字节数
//2事件发生时间
	0x201E0200,//对应698数据的关联OAD
	DataType_date_time_s,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	6,//在DL645-2007返回帧中有效字节数	
};


////B81电表清零
//	81,//对应DL645-2007主动上报状态字中的位B0-B95
//	0x30130200,//对应事件的OAD
//	0x03300100,//对应DL645-2007事件发生次数的抄读标识,0=空
//	0,//对应DL645-2007事件累计时间的抄读标识,0=空
//	0x03300101,//对应DL645-2007最近1次事件的抄读标识,0=空
//	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
__align(4) const RM_Event_DL2007_typedef RM_Event_DL2007_3013[]=//B81电表清零 
{
	0x30130200,//对应事件的OAD
	0x03300100,//对应DL645-2007事件发生次数的抄读标识,0=空
	0,//对应DL645-2007事件累计时间的抄读标识,0=空
	0x03300101,//对应DL645-2007最近1次事件的抄读标识,0=空
	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
	
	26,//抄读标识1关联数据OAD个数
	0,//抄读标识2关联数据OAD个数
//1事件记录序号(总是排在第一个)
	0x20220200,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	3,//在DL645-2007返回帧中有效字节数
//2事件发生时间
	0x201E0200,//对应698数据的关联OAD
	DataType_date_time_s,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	6,//在DL645-2007返回帧中有效字节数	
//3电表清零前正向有功总电能
	0x00102201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	10,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//4电表清零前反向有功总电能
	0x00202201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	14,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//5电表清零前第一象限无功总电能
	0x00502201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	18,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//6电表清零前第二象限无功总电能
	0x00602201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	22,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//7电表清零前第三象限无功总电能
	0x00702201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	26,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//8电表清零前第四象限无功总电能
	0x00802201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	30,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//9电表清零前A相正向有功电能
	0x00112201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	34,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//10电表清零前A相反向有功电能
	0x00212201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	38,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//11电表清零前A相第一象限无功电能
	0x00512201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	42,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//12电表清零前A相第二象限无功电能	
	0x00612201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	46,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//13电表清零前A相第三象限无功电能	
	0x00712201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	50,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//14电表清零前A相第四象限无功电能	
	0x00812201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	54,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//15电表清零前B相正向有功电能
	0x00122201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	58,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//16电表清零前B相反向有功电能
	0x00222201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	62,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//17电表清零前B相第一象限无功电能	
	0x00522201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	66,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//18电表清零前B相第二象限无功电能	
	0x00622201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	70,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//19电表清零前B相第三象限无功电能	
	0x00722201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	74,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//20电表清零前B相第四象限无功电能	
	0x00822201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	78,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//21电表清零前C相正向有功电能
	0x00132201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	82,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//22电表清零前C相反向有功电能
	0x00232201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	86,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//23电表清零前C相第一象限无功电能
	0x00532201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	90,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//24电表清零前C相第二象限无功电能
	0x00632201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	94,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//25电表清零前C相第三象限无功电能
	0x00732201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	98,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
//26电表清零前C相第四象限无功电能
	0x00832201,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	102,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	4,//在DL645-2007返回帧中有效字节数
};

