gdgly/NUC97X_JS/STM32F4xx/DL698/RM_Event_DL2007.c
////B82需量清零
//	82,//对应DL645-2007主动上报状态字中的位B0-B95
//	0x30140200,//对应事件的OAD
//	0x03300200,//对应DL645-2007事件发生次数的抄读标识,0=空
//	0,//对应DL645-2007事件累计时间的抄读标识,0=空
//	0x03300201,//对应DL645-2007最近1次事件的抄读标识,0=空
//	0,//对应DL645-2007最近1次事件的抄读标识2,0=空

////B83事件清零
//	83,//对应DL645-2007主动上报状态字中的位B0-B95
//	0x30150200,//对应事件的OAD
//	0x03300300,//对应DL645-2007事件发生次数的抄读标识,0=空
//	0,//对应DL645-2007事件累计时间的抄读标识,0=空
//	0x03300301,//对应DL645-2007最近1次事件的抄读标识,0=空
//	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
__align(4) const RM_Event_DL2007_typedef RM_Event_DL2007_3015[]=//B83事件清零
{
	0x30150200,//对应事件的OAD
	0x03300300,//对应DL645-2007事件发生次数的抄读标识,0=空
	0,//对应DL645-2007事件累计时间的抄读标识,0=空
	0x03300301,//对应DL645-2007最近1次事件的抄读标识,0=空
	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
	
	2,//抄读标识1关联数据OAD个数
	0,//抄读标识2关联数据OAD个数
//1事件记录序号(总是排在第一个)
	0x20220200,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	3,//在DL645-2007返回帧中有效字节数
//2事件发生时间
	0x201E0200,//对应698数据的关联OAD
	DataType_date_time_s,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	6,//在DL645-2007返回帧中有效字节数	
};

////B84校时
//	84,//对应DL645-2007主动上报状态字中的位B0-B95
//	0x30160200,//对应事件的OAD
//	0x03300400,//对应DL645-2007事件发生次数的抄读标识,0=空
//	0,//对应DL645-2007事件累计时间的抄读标识,0=空
//	0x03300401,//对应DL645-2007最近1次事件的抄读标识,0=空
//	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
__align(4) const RM_Event_DL2007_typedef RM_Event_DL2007_3016[]=//B84校时 
{
	0x30160200,//对应事件的OAD
	0x03300400,//对应DL645-2007事件发生次数的抄读标识,0=空
	0,//对应DL645-2007事件累计时间的抄读标识,0=空
	0x03300401,//对应DL645-2007最近1次事件的抄读标识,0=空
	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
	
	5,//抄读标识1关联数据OAD个数
	0,//抄读标识2关联数据OAD个数
//1事件记录序号(总是排在第一个)
	0x20220200,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	3,//在DL645-2007返回帧中有效字节数
#if (USER/100)==15//安徽
//2事件发生时间
	0x201E0200,//对应698数据的关联OAD
	DataType_date_time_s,//对应698的数据类型
	4,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	6,//在DL645-2007返回帧中有效字节数	
//3事件结束时间
	0x20200200,//对应698数据的关联OAD
	DataType_date_time_s,//对应698的数据类型
	10,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	6,//在DL645-2007返回帧中有效字节数
#else
//2事件发生时间
	0x201E0200,//对应698数据的关联OAD
	DataType_date_time_s,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	0,//在DL645-2007返回帧中有效字节数	
//3事件结束时间
	0x20200200,//对应698数据的关联OAD
	DataType_date_time_s,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	0,//在DL645-2007返回帧中有效字节数
	#endif
//4校时前时间
	0x40002200,//对应698数据的关联OAD
	DataType_date_time_s,//对应698的数据类型
	4,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	6,//在DL645-2007返回帧中有效字节数
//5校时后时间
	0x40008200,//对应698数据的关联OAD
	DataType_date_time_s,//对应698的数据类型
	10,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	6,//在DL645-2007返回帧中有效字节数	
};

////B85时段表编程
//	85,//对应DL645-2007主动上报状态字中的位B0-B95
//	0x30170200,//对应事件的OAD
//	0x03300500,//对应DL645-2007事件发生次数的抄读标识,0=空
//	0,//对应DL645-2007事件累计时间的抄读标识,0=空
//	0x03300501,//对应DL645-2007最近1次事件的抄读标识,0=空
//	0,//对应DL645-2007最近1次事件的抄读标识2,0=空

////B86时区表编程
//	86,//对应DL645-2007主动上报状态字中的位B0-B95
//	0x30180200,//对应事件的OAD
//	0x03300600,//对应DL645-2007事件发生次数的抄读标识,0=空
//	0,//对应DL645-2007事件累计时间的抄读标识,0=空
//	0x03300601,//对应DL645-2007最近1次事件的抄读标识,0=空
//	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
__align(4) const RM_Event_DL2007_typedef RM_Event_DL2007_3018[]=//B86时区表编程 
{
	0x30180200,//对应事件的OAD
	0x03300600,//对应DL645-2007事件发生次数的抄读标识,0=空
	0,//对应DL645-2007事件累计时间的抄读标识,0=空
	0x03300601,//对应DL645-2007最近1次事件的抄读标识,0=空
	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
	
	2,//抄读标识1关联数据OAD个数
	0,//抄读标识2关联数据OAD个数
//1事件记录序号(总是排在第一个)
	0x20220200,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	3,//在DL645-2007返回帧中有效字节数
//2事件发生时间
	0x201E0200,//对应698数据的关联OAD
	DataType_date_time_s,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	6,//在DL645-2007返回帧中有效字节数	
};

////B87周休日编程
//	87,//对应DL645-2007主动上报状态字中的位B0-B95
//	0x30190200,//对应事件的OAD
//	0x03300700,//对应DL645-2007事件发生次数的抄读标识,0=空
//	0,//对应DL645-2007事件累计时间的抄读标识,0=空
//	0x03300701,//对应DL645-2007最近1次事件的抄读标识,0=空
//	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
__align(4) const RM_Event_DL2007_typedef RM_Event_DL2007_3019[]=//B87周休日编程 
{
	0x30190200,//对应事件的OAD
	0x03300700,//对应DL645-2007事件发生次数的抄读标识,0=空
	0,//对应DL645-2007事件累计时间的抄读标识,0=空
	0x03300701,//对应DL645-2007最近1次事件的抄读标识,0=空
	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
	
	3,//抄读标识1关联数据OAD个数
	0,//抄读标识2关联数据OAD个数
//1事件记录序号(总是排在第一个)
	0x20220200,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	3,//在DL645-2007返回帧中有效字节数
//2事件发生时间
	0x201E0200,//对应698数据的关联OAD
	DataType_date_time_s,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	6,//在DL645-2007返回帧中有效字节数	
//3编程前周休日釆用的日时段表号
	0x40132200,//对应698数据的关联OAD
	DataType_unsigned,//对应698的数据类型
	10,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	1,//在DL645-2007返回帧中有效字节数	
};

////B88节假日编程
//	88,//对应DL645-2007主动上报状态字中的位B0-B95
//	0x30210200,//对应事件的OAD
//	0x03300800,//对应DL645-2007事件发生次数的抄读标识,0=空
//	0,//对应DL645-2007事件累计时间的抄读标识,0=空
//	0x03300801,//对应DL645-2007最近1次事件的抄读标识,0=空
//	0,//对应DL645-2007最近1次事件的抄读标识2,0=空

////B89有功组合方式编程
//	89,//对应DL645-2007主动上报状态字中的位B0-B95
//	0x30220200,//对应事件的OAD
//	0x03300900,//对应DL645-2007事件发生次数的抄读标识,0=空
//	0,//对应DL645-2007事件累计时间的抄读标识,0=空
//	0x03300901,//对应DL645-2007最近1次事件的抄读标识,0=空
//	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
__align(4) const RM_Event_DL2007_typedef RM_Event_DL2007_3022[]=//B89有功组合方式编程
{
	0x30220200,//对应事件的OAD
	0x03300900,//对应DL645-2007事件发生次数的抄读标识,0=空
	0,//对应DL645-2007事件累计时间的抄读标识,0=空
	0x03300901,//对应DL645-2007最近1次事件的抄读标识,0=空
	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
	
	3,//抄读标识1关联数据OAD个数
	0,//抄读标识2关联数据OAD个数
//1事件记录序号(总是排在第一个)
	0x20220200,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	3,//在DL645-2007返回帧中有效字节数
//2事件发生时间
	0x201E0200,//对应698数据的关联OAD
	DataType_date_time_s,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	6,//在DL645-2007返回帧中有效字节数	
//3有功组合方式编程前的有功组合方式特征字
	0x41122200,//对应698数据的关联OAD
	DataType_unsigned,//对应698的数据类型
	10,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	1,//在DL645-2007返回帧中有效字节数	
};

////B90无功组合方式1编程
//	90,//对应DL645-2007主动上报状态字中的位B0-B95
//	0x30230200,//对应事件的OAD
//	0x03300A00,//对应DL645-2007事件发生次数的抄读标识,0=空
//	0,//对应DL645-2007事件累计时间的抄读标识,0=空
//	0x03300A01,//对应DL645-2007最近1次事件的抄读标识,0=空
//	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
__align(4) const RM_Event_DL2007_typedef RM_Event_DL2007_3023[]=//B90无功组合方式1编程
{
	0x30230200,//对应事件的OAD
	0x03300A00,//对应DL645-2007事件发生次数的抄读标识,0=空
	0,//对应DL645-2007事件累计时间的抄读标识,0=空
	0x03300A01,//对应DL645-2007最近1次事件的抄读标识,0=空
	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
	
	3,//抄读标识1关联数据OAD个数
	0,//抄读标识2关联数据OAD个数
//1事件记录序号(总是排在第一个)
	0x20220200,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	3,//在DL645-2007返回帧中有效字节数
//2事件发生时间
	0x201E0200,//对应698数据的关联OAD
	DataType_date_time_s,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	6,//在DL645-2007返回帧中有效字节数	
//3编程前无功组合方式1特征字
	0x41132200,//对应698数据的关联OAD
	DataType_unsigned,//对应698的数据类型
	10,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	1,//在DL645-2007返回帧中有效字节数	
};

