gdgly/NUC97X_JS/STM32F4xx/DL698/RM_Event_DL2007.c
////B91无功组合方式2编程
//	91,//对应DL645-2007主动上报状态字中的位B0-B95
//	0x30230200,//对应事件的OAD
//	0x03300B00,//对应DL645-2007事件发生次数的抄读标识,0=空
//	0,//对应DL645-2007事件累计时间的抄读标识,0=空
//	0x03300B01,//对应DL645-2007最近1次事件的抄读标识,0=空
//	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
__align(4) const RM_Event_DL2007_typedef RM_Event_DL2007_30230200[]=//B91无功组合方式2编程
{
	0x30230200,//对应事件的OAD
	0x03300B00,//对应DL645-2007事件发生次数的抄读标识,0=空
	0,//对应DL645-2007事件累计时间的抄读标识,0=空
	0x03300B01,//对应DL645-2007最近1次事件的抄读标识,0=空
	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
	
	3,//抄读标识1关联数据OAD个数
	0,//抄读标识2关联数据OAD个数
//1事件记录序号(总是排在第一个)
	0x20220200,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	3,//在DL645-2007返回帧中有效字节数
//2事件发生时间
	0x201E0200,//对应698数据的关联OAD
	DataType_date_time_s,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	6,//在DL645-2007返回帧中有效字节数	
//3编程前无功组合方式2特征字
	0x41142200,//对应698数据的关联OAD
	DataType_unsigned,//对应698的数据类型
	10,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	1,//在DL645-2007返回帧中有效字节数	
};

////B92结算日编程
//	92,//对应DL645-2007主动上报状态字中的位B0-B95
//	0x301A0200,//对应事件的OAD
//	0x03300C00,//对应DL645-2007事件发生次数的抄读标识,0=空
//	0,//对应DL645-2007事件累计时间的抄读标识,0=空
//	0x03300C01,//对应DL645-2007最近1次事件的抄读标识,0=空
//	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
__align(4) const RM_Event_DL2007_typedef RM_Event_DL2007_301A[]=//B92结算日编程
{
	0x301A0200,//对应事件的OAD
	0x03300C00,//对应DL645-2007事件发生次数的抄读标识,0=空
	0,//对应DL645-2007事件累计时间的抄读标识,0=空
	0x03300C01,//对应DL645-2007最近1次事件的抄读标识,0=空
	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
	
	2,//抄读标识1关联数据OAD个数
	0,//抄读标识2关联数据OAD个数
//1事件记录序号(总是排在第一个)
	0x20220200,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	3,//在DL645-2007返回帧中有效字节数
//2事件发生时间
	0x201E0200,//对应698数据的关联OAD
	DataType_date_time_s,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	6,//在DL645-2007返回帧中有效字节数	
};

////B93费率参数表编程
//	93,//对应DL645-2007主动上报状态字中的位B0-B95
//	0x30240200,//对应事件的OAD
//	0x03300F00,//对应DL645-2007事件发生次数的抄读标识,0=空
//	0,//对应DL645-2007事件累计时间的抄读标识,0=空
//	0x03300F01,//对应DL645-2007最近1次事件的抄读标识,0=空
//	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
__align(4) const RM_Event_DL2007_typedef RM_Event_DL2007_3024[]=//B93费率参数表编程
{
	0x30240200,//对应事件的OAD
	0x03300F00,//对应DL645-2007事件发生次数的抄读标识,0=空
	0,//对应DL645-2007事件累计时间的抄读标识,0=空
	0x03300F01,//对应DL645-2007最近1次事件的抄读标识,0=空
	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
	
	2,//抄读标识1关联数据OAD个数
	0,//抄读标识2关联数据OAD个数
//1事件记录序号(总是排在第一个)
	0x20220200,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	3,//在DL645-2007返回帧中有效字节数
//2事件发生时间
	0x201E0200,//对应698数据的关联OAD
	DataType_date_time_s,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	6,//在DL645-2007返回帧中有效字节数	
};

////B94阶梯表编程
//	94,//对应DL645-2007主动上报状态字中的位B0-B95
//	0x30250200,//对应事件的OAD
//	0x03301000,//对应DL645-2007事件发生次数的抄读标识,0=空
//	0,//对应DL645-2007事件累计时间的抄读标识,0=空
//	0x03301001,//对应DL645-2007最近1次事件的抄读标识,0=空
//	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
__align(4) const RM_Event_DL2007_typedef RM_Event_DL2007_3025[]=//B94阶梯表编程
{
	0x30250200,//对应事件的OAD
	0x03301000,//对应DL645-2007事件发生次数的抄读标识,0=空
	0,//对应DL645-2007事件累计时间的抄读标识,0=空
	0x03301001,//对应DL645-2007最近1次事件的抄读标识,0=空
	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
	
	2,//抄读标识1关联数据OAD个数
	0,//抄读标识2关联数据OAD个数
//1事件记录序号(总是排在第一个)
	0x20220200,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	3,//在DL645-2007返回帧中有效字节数
//2事件发生时间
	0x201E0200,//对应698数据的关联OAD
	DataType_date_time_s,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	6,//在DL645-2007返回帧中有效字节数	
};

////B95密钥更新
//	95,//对应DL645-2007主动上报状态字中的位B0-B95
//	0x30260200,//对应事件的OAD
//	0x03301200,//对应DL645-2007事件发生次数的抄读标识,0=空
//	0,//对应DL645-2007事件累计时间的抄读标识,0=空
//	0x03301201,//对应DL645-2007最近1次事件的抄读标识,0=空
//	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
__align(4) const RM_Event_DL2007_typedef RM_Event_DL2007_3026[]=//B95密钥更新
{
	0x30260200,//对应事件的OAD
	0x03301200,//对应DL645-2007事件发生次数的抄读标识,0=空
	0,//对应DL645-2007事件累计时间的抄读标识,0=空
	0x03301201,//对应DL645-2007最近1次事件的抄读标识,0=空
	0,//对应DL645-2007最近1次事件的抄读标识2,0=空
	
	2,//抄读标识1关联数据OAD个数
	0,//抄读标识2关联数据OAD个数
//1事件记录序号(总是排在第一个)
	0x20220200,//对应698数据的关联OAD
	DataType_double_long_unsigned,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	3,//在DL645-2007返回帧中有效字节数
//2事件发生时间
	0x201E0200,//对应698数据的关联OAD
	DataType_date_time_s,//对应698的数据类型
	0,//在DL645-2007返回帧中数据标识后开始的偏移字节数
	6,//在DL645-2007返回帧中有效字节数	
};




__align(4) const DL698_LIB_List_TypeDef RM_Event_DL2007_LIST[]=
{
	(u32*)RM_Event_DL2007_302B,//B0负荷开关误动或拒动
//B1 ESAM错误
//B2 内卡初始化错误	
//B3 时钟电池电压低
//B4 内部程序错误
//B5 存储器故障或损坏
//B6 保留
//B7 时钟故障
//B8 停电抄表电池欠压
//B9 透支状态
	(u32*)RM_Event_DL2007_301B,//B10开表盖
	(u32*)RM_Event_DL2007_301C,//B11开端钮盖
	(u32*)RM_Event_DL2007_302A,//B12恒定磁场干扰	
	(u32*)RM_Event_DL2007_302C,//B13电源异常
	(u32*)RM_Event_DL2007_301F,//B14跳闸成功
	(u32*)RM_Event_DL2007_3020,//B15合闸成功
	(u32*)RM_Event_DL2007_30000700,//B16 A相失压
	(u32*)RM_Event_DL2007_30010700,//B17 A相欠压
	(u32*)RM_Event_DL2007_30020700,//B18 A相过压
	(u32*)RM_Event_DL2007_30040700,//B19 A相失流
	(u32*)RM_Event_DL2007_30050700,//B20 A相过流
	(u32*)RM_Event_DL2007_30080700,//B21 A相过载
	(u32*)RM_Event_DL2007_30070700,//B22 A相功率反向
	(u32*)RM_Event_DL2007_30030700,//B23 A相断相
	(u32*)RM_Event_DL2007_30060700,//B24 A相断流
//B25-B31保留	
	(u32*)RM_Event_DL2007_30000800,//B32 B相失压
	(u32*)RM_Event_DL2007_30010800,//B33 B相欠压
	(u32*)RM_Event_DL2007_30020800,//B34 B相过压
	(u32*)RM_Event_DL2007_30040800,//B35 B相失流
	(u32*)RM_Event_DL2007_30050800,//B36 B相过流
	(u32*)RM_Event_DL2007_30080800,//B37 B相过载
	(u32*)RM_Event_DL2007_30070800,//B38 B相功率反向
	(u32*)RM_Event_DL2007_30030800,//B39 B相断相
	(u32*)RM_Event_DL2007_30060800,//B40 B相断流
//B41-B47保留	
	(u32*)RM_Event_DL2007_30000900,//B48 C相失压
	(u32*)RM_Event_DL2007_30010900,//B49 C相欠压
	(u32*)RM_Event_DL2007_30020900,//B50 C相过压
	(u32*)RM_Event_DL2007_30040900,//B51 C相失流
	(u32*)RM_Event_DL2007_30050900,//B52 C相过流
	(u32*)RM_Event_DL2007_30080900,//B53 C相过载
	(u32*)RM_Event_DL2007_30070900,//B54 C相功率反向
	(u32*)RM_Event_DL2007_30030900,//B55 C相断相
	(u32*)RM_Event_DL2007_30060900,//B56 C相断流
//B57-B63保留
	(u32*)RM_Event_DL2007_300F,//B64电压逆相序
	(u32*)RM_Event_DL2007_3010,//B65电流逆相序
	(u32*)RM_Event_DL2007_301D,//B66电压不平衡
	(u32*)RM_Event_DL2007_301E,//B67电流不平衡
	(u32*)RM_Event_DL2007_300E,//B68辅助电源失电
	(u32*)RM_Event_DL2007_3011,//B69掉电
	(u32*)RM_Event_DL2007_3009,//B70电能表正向有功需量超限事件
	(u32*)RM_Event_DL2007_300C,//B71总功率因数超下限
	(u32*)RM_Event_DL2007_302D,//B72电流严重不平衡
	(u32*)RM_Event_DL2007_3007,//B73潮流反向(功率反向代) 
	(u32*)RM_Event_DL2007_300D,//B74全失压 
//B75-B79保留
	(u32*)RM_Event_DL2007_3012,//B80编程 
	(u32*)RM_Event_DL2007_3013,//B81电表清零 
//B82需量清零（返回长度202字节，暂不做）
	(u32*)RM_Event_DL2007_3015,//B83事件清零
	(u32*)RM_Event_DL2007_3016,//B84校时 
//B85时段表编程（返回长度682字节，暂不做）
	(u32*)RM_Event_DL2007_3018,//B86时区表编程 
	(u32*)RM_Event_DL2007_3019,//B87周休日编程 
//B88节假日编程（返回长度1026字节，暂不做）
	(u32*)RM_Event_DL2007_3022,//B89有功组合方式编程
	(u32*)RM_Event_DL2007_3023,//B90无功组合方式1编程
	(u32*)RM_Event_DL2007_30230200,//B91无功组合方式2编程(698标识和B90无功组合方式1编程一样)
	(u32*)RM_Event_DL2007_301A,//B92结算日编程
	(u32*)RM_Event_DL2007_3024,//B93费率参数表编程
	(u32*)RM_Event_DL2007_3025,//B94阶梯表编程
	(u32*)RM_Event_DL2007_3026,//B95密钥更新
};





u32 Get_Event645_DI(u32 OAD,u32 RMCount)//得到DL645事件抄读的DI，入口:OAD=事件OAD，RMCount=抄表命令计数(从0开始)，返回:抄读的DI(0=没有要抄读的数据标识)
{
	u32 i;
	RM_Event_DL2007_typedef* pLib;
	
	for(i=0;i<(sizeof(RM_Event_DL2007_LIST)/4);i++)
	{
		pLib=(RM_Event_DL2007_typedef*)RM_Event_DL2007_LIST[i].pLib;
		if(pLib->OAD==OAD)
		{
			switch(RMCount)
			{
				case 0:
					return pLib->DI_NUM;//对应DL645-2007事件发生次数的抄读标识,0=空
				case 1:
					return pLib->DI_LASTEVENT1;//对应DL645-2007最近1次事件的抄读标识1,0=空
			}
		}
	}
	return 0;
}

u32 Change_Frame_645_to_698(u32 PORTn)//把645的事件数据帧转成698格式
{
	u32 i;
	u32 x;
	u32 n;
	u32 OAD;
	u32 Data;
	u32 LEN_Rx;
	u32 LEN_RxDataBuff;
	u32 LEN_Data0;
	u32 LEN_Data1;
//	u8* p8Array;
	u8* p8Data;
	u16* p16Data;
	u8* p8rx;
	UARTCtrl_TypeDef * UARTCtrl;
	u32 offset;
	u32 offset2;
	u32 offset3;
	u32 byte;
	RM_Event_DL2007_typedef* pLib;
	RM_Event_DL2007_DATAOAD_typedef* pLibOAD;
	
