gdgly/NUC97X_JS/STM32F4xx/DL698/RM_Event_DL2007.c
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	LEN_RxDataBuff=Get_LEN_UARTnFnDataBuff(PORTn);//得到UART抄表数据缓冲长度
	LEN_RxDataBuff-=(LEN_RM_DI_CSD+4);
	p8Data=(u8 *)Get_ADDR_UARTnFnDataBuff(PORTn);
	p16Data=(u16*)(p8Data+LEN_RM_DI_CSD);
	LEN_Data1=p16Data[1];
	if(LEN_RxDataBuff<LEN_Data1)
	{//错
		return 3;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127
	}
	LEN_RxDataBuff-=LEN_Data1;
	p8Data+=LEN_RM_DI_CSD+4+LEN_Data1;
//	p8Array=(u8*)p8Data;
	if(UARTCtrl->RMCSDSubCount==0)//抄表CSD子计数(非DL698抄表时)
	{
		p16Data[0]=0;//已填写入buff但还没完整一个CSD的数据长度(不包括本身2字节)
	}
	LEN_Data0=p16Data[0];
	if(LEN_RxDataBuff<LEN_Data0)
	{//错
		return 1;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127
	}
	LEN_RxDataBuff-=LEN_Data0;
	
	if(UARTCtrl->RMCSD[1]==0)//非ROAD错
	{
		if(UARTCtrl->RMCSDSubCount)//抄表CSD子计数(非DL698抄表时)
		{
			if(LEN_RxDataBuff<1)
			{//缓冲长度不够
				return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127
			}
			p8Data[0]=0;
			LEN_Data0+=1;
			p16Data[0]=LEN_Data0;
		}
		return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127
	}
	if(UARTCtrl->RMCSD[6]==0)//关联OAD个数是0，不需要列选
	{
		return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127
	}
	OAD=UARTCtrl->RMCSD[5]|(UARTCtrl->RMCSD[4]<<8)|(UARTCtrl->RMCSD[3]<<16)|(UARTCtrl->RMCSD[2]<<24);
	if(OAD==0x301C0200)
	{
		i=0;
	}
	for(i=0;i<(sizeof(RM_Event_DL2007_LIST)/4);i++)
	{
		pLib=(RM_Event_DL2007_typedef*)RM_Event_DL2007_LIST[i].pLib;
		if(pLib->OAD==OAD)
		{
			break;
		}
	}
	if(i>=(sizeof(RM_Event_DL2007_LIST)/4))
	{
		return 0;//没找到库
	}
	p8rx=(u8 *)Get_ADDR_UARTnRx(PORTn);
	LEN_Rx=p8rx[9];
	if(LEN_Rx<=4)
	{//长度<4
		return 0;
	}
	pLibOAD=pLib->DATAOAD;
	i=UARTCtrl->RMCSDSubCount;//抄表CSD子计数
	switch(i)
	{
		case 0://抄表计数0
			p8rx+=14;
			offset=pLibOAD->offset;
			byte=pLibOAD->byte;
			if(byte>6)
			{
				return 0;
			}
			//BCD码的发生次数暂存在UARTCtrl->RM_Rx_date_40020200+2地址
			MC(0,(u32)&UARTCtrl->RM_Rx_date_40020200+2,6);
			MR((u32)&UARTCtrl->RM_Rx_date_40020200+2,(u32)p8rx+offset,byte);
			break;
		case 1://抄表计数1
			p8rx+=14;
			n=UARTCtrl->RMCSD[6];//关联OAD个数
			for(i=0;i<n;i++)
			{
				OAD=(UARTCtrl->RMCSD[7+(4*i)]<<24)|(UARTCtrl->RMCSD[7+(4*i)+1]<<16)|(UARTCtrl->RMCSD[7+(4*i)+2]<<8)|(UARTCtrl->RMCSD[7+(4*i)+3]<<0);
				switch(OAD)
				{
					case 0x20220200://发生次数
						//BCD码的发生次数暂存在UARTCtrl->RM_Rx_date_40020200+2地址
						Data=MRR((u32)&UARTCtrl->RM_Rx_date_40020200+2,3);
						Data=bcd_hex(Data);
						if(LEN_RxDataBuff<5)
						{//缓冲长度不够
							return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127
						}
						p8Data[0]=DataType_double_long_unsigned;
						p8Data[1]=Data>>24;
						p8Data[2]=Data>>16;
						p8Data[3]=Data>>8;
						p8Data[4]=Data>>0;
						p8Data+=5;
						LEN_Data0+=5;
						LEN_RxDataBuff-=5;
						continue;
					case 0xF2050201://负荷开关误动作时状态
					//属性2（设备对象列表，只读）∷=array 继电器单元
					//继电器单元∷=structure
					//{
					//  描述符    visible-string，
					//当前状态  enum{合闸（0），跳闸（1） }，
					//开关属性  enum{脉冲式（0），保持式（1）}，
					//接线状态  enum{接入（0），未接入（1) }
					//}
						if(LEN_RxDataBuff<12)
						{//缓冲长度不够
							return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127
						}
						p8Data[0]=DataType_array;
						p8Data[1]=1;
						p8Data[2]=DataType_structure;
						p8Data[3]=4;
						p8Data[4]=DataType_visible_string;
						p8Data[5]=0;
						p8Data[6]=DataType_enum;
						p8Data[7]=p8rx[12];//{合闸（0），跳闸（1） }
						p8Data[8]=DataType_enum;
						p8Data[9]=1;//{脉冲式（0），保持式（1）}
						p8Data[10]=DataType_enum;
						p8Data[11]=0;//{接入（0），未接入（1) }
						p8Data+=12;
						LEN_Data0+=12;
						LEN_RxDataBuff-=12;
						continue;
					case 0x20002200://事件发生时刻电压数组
						OAD=UARTCtrl->RMCSD[5]|(UARTCtrl->RMCSD[4]<<8)|(UARTCtrl->RMCSD[3]<<16)|(UARTCtrl->RMCSD[2]<<24);
						switch(OAD)
						{
							case 0x30000700://A相失压
							case 0x30000800://B相失压
							case 0x30000900://C相失压
							case 0x30010700://A相欠压
							case 0x30010800://B相欠压
							case 0x30010900://C相欠压
							case 0x30020700://A相过压
							case 0x30020800://B相过压
							case 0x30020900://C相过压
							case 0x30030700://A相断相
							case 0x30030800://B相断相
							case 0x30030900://C相断相
							case 0x30040700://A相失流
							case 0x30040800://B相失流
							case 0x30040900://C相失流
							case 0x30050700://A相过流
							case 0x30050800://B相过流
							case 0x30050900://C相过流
							case 0x30060700://A相断流
							case 0x30060800://B相断流
							case 0x30060900://C相断流
								offset=38;//A相电压
								offset2=67;//B相电压
								offset3=96;//C相电压
								break;
							
							default:
								if(LEN_RxDataBuff<1)
								{//缓冲长度不够
									return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127
								}
								p8Data[0]=0;
								p8Data+=1;
								LEN_Data0+=1;
								LEN_RxDataBuff-=1;
								continue;
						}
						if(LEN_RxDataBuff<11)
						{//缓冲长度不够
							return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127
						}
						p8Data[0]=DataType_array;
						p8Data[1]=3;
						p8Data[2]=DataType_long_unsigned;
						Data=p8rx[offset]|(p8rx[offset+1]<<8);
						if(Data==0xffff)
						{
							Data=0;
						}
						Data=bcd_hex(Data);
						p8Data[3]=Data>>8;
						p8Data[4]=Data>>0;
						p8Data[5]=DataType_long_unsigned;
						Data=p8rx[offset2]|(p8rx[offset2+1]<<8);
						if(Data==0xffff)
						{
							Data=0;
						}
						Data=bcd_hex(Data);
						p8Data[6]=Data>>8;
						p8Data[7]=Data>>0;
						p8Data[8]=DataType_long_unsigned;
						Data=p8rx[offset3]|(p8rx[offset3+1]<<8);
						if(Data==0xffff)
						{
							Data=0;
						}
						Data=bcd_hex(Data);
						p8Data[9]=Data>>8;
						p8Data[10]=Data>>0;
						p8Data+=11;
						LEN_Data0+=11;
						LEN_RxDataBuff-=11;
						continue;
					case 0x20012200://事件发生时刻电流数组
						OAD=UARTCtrl->RMCSD[5]|(UARTCtrl->RMCSD[4]<<8)|(UARTCtrl->RMCSD[3]<<16)|(UARTCtrl->RMCSD[2]<<24);
						switch(OAD)
						{
							case 0x30000700://A相失压
							case 0x30000800://B相失压
							case 0x30000900://C相失压
							case 0x30010700://A相欠压
							case 0x30010800://B相欠压
							case 0x30010900://C相欠压
							case 0x30020700://A相过压
							case 0x30020800://B相过压
							case 0x30020900://C相过压
							case 0x30030700://A相断相
							case 0x30030800://B相断相
							case 0x30030900://C相断相
							case 0x30040700://A相失流
							case 0x30040800://B相失流
							case 0x30040900://C相失流
							case 0x30050700://A相过流
							case 0x30050800://B相过流
							case 0x30050900://C相过流
							case 0x30060700://A相断流
							case 0x30060800://B相断流
							case 0x30060900://C相断流
								offset=40;//A相电流
								offset2=69;//B相电流
								offset3=98;//C相电流
								break;
							default:
								if(LEN_RxDataBuff<1)
								{//缓冲长度不够
									return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127
								}
								p8Data[0]=0;
								p8Data+=1;
								LEN_Data0+=1;
								LEN_RxDataBuff-=1;
								continue;
						}
						if(LEN_RxDataBuff<17)
						{//缓冲长度不够
							return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127
						}
						p8Data[0]=DataType_array;
						p8Data[1]=3;
						p8Data[2]=DataType_double_long;
						Data=p8rx[offset]|(p8rx[offset+1]<<8)|(p8rx[offset+2]<<16);
						if(Data==0xffffff)
						{
							Data=0;
						}
						x=0;
						if(Data&(1<<23))
						{
							x=1;
							Data&=0x7fffff;
						}
						Data=bcd_hex(Data);
						if(x)
						{
							Data=~Data;
							Data+=1;
						}
						p8Data[3]=Data>>24;
						p8Data[4]=Data>>16;
						p8Data[5]=Data>>8;
						p8Data[6]=Data>>0;
						p8Data[7]=DataType_double_long;
						Data=p8rx[offset2]|(p8rx[offset2+1]<<8)|(p8rx[offset2+2]<<16);
						if(Data==0xffffff)
						{
							Data=0;
						}
						x=0;
						if(Data&(1<<23))
						{
							x=1;
							Data&=0x7fffff;
						}
						Data=bcd_hex(Data);
						if(x)
						{
							Data=~Data;
							Data+=1;
						}
						p8Data[8]=Data>>24;
						p8Data[9]=Data>>16;
						p8Data[10]=Data>>8;
						p8Data[11]=Data>>0;
						p8Data[12]=DataType_double_long;
						Data=p8rx[offset3]|(p8rx[offset3+1]<<8)|(p8rx[offset3+2]<<16);
						if(Data==0xffffff)
						{
							Data=0;
						}
						x=0;
						if(Data&(1<<23))
						{
							x=1;
							Data&=0x7fffff;
						}
						Data=bcd_hex(Data);
						if(x)
						{
							Data=~Data;
							Data+=1;
						}
						p8Data[13]=Data>>24;
						p8Data[14]=Data>>16;
						p8Data[15]=Data>>8;
						p8Data[16]=Data>>0;
						p8Data+=17;
						LEN_Data0+=17;
						LEN_RxDataBuff-=17;
						continue;
					//功率数组
						
					//功率因数数组
					default:
						break;
				}
				pLibOAD=pLib->DATAOAD;
				for(x=0;x<pLib->NUM_OAD1;x++)
				{
					if(OAD==pLibOAD->OAD)
					{
						break;
					}
					pLibOAD++;
				}
				if(x>=pLib->NUM_OAD1)
				{//库中没找到关联OAD列表
					if(LEN_RxDataBuff<1)
					{//缓冲长度不够
						return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127
					}
					p8Data[0]=0;
					p8Data+=1;
					LEN_Data0+=1;
					LEN_RxDataBuff-=1;
					continue;
				}
				offset=pLibOAD->offset;
				byte=pLibOAD->byte;
				switch(pLibOAD->DataType)//关联OAD的数据类型
				{
					case DataType_date_time_s:
						if(LEN_RxDataBuff<8)
						{//缓冲长度不够
							return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127
						}
						switch(byte)
						{
							case 6:
								p8Data[0]=DataType_date_time_s;
								Data=p8rx[offset+5];//年
								Data=bcd_hex(Data);
								Data+=2000;
								p8Data[1]=Data>>8;
								p8Data[2]=Data;
								for(x=0;x<5;x++)								
								{
									Data=p8rx[offset+4-x];
									Data=bcd_hex(Data);
									p8Data[3+x]=Data;
								}
								p8Data+=8;
								LEN_Data0+=8;
								LEN_RxDataBuff-=8;
								break;
							default:
								p8Data[0]=0;
								p8Data+=1;
								LEN_Data0+=1;
								LEN_RxDataBuff-=1;
								break;
						}
						break;
					case DataType_double_long_unsigned:
						if(LEN_RxDataBuff<5)
						{//缓冲长度不够
							return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127
						}
						if(byte>4)
						{
							p8Data[0]=0;
							p8Data+=1;
							LEN_Data0+=1;
							LEN_RxDataBuff-=1;
							break;
						}
						Data=MRR((u32)p8rx+offset,byte);
						if((Data&0xff)==0xff)
						{
							Data=0;
						}
						Data=bcd_hex(Data);
						p8Data[0]=DataType_double_long_unsigned;
						p8Data[1]=Data>>24;
						p8Data[2]=Data>>16;
						p8Data[3]=Data>>8;
						p8Data[4]=Data>>0;
						p8Data+=5;
						LEN_Data0+=5;
						LEN_RxDataBuff-=5;
						break;
					case DataType_double_long:
						if(LEN_RxDataBuff<5)
						{//缓冲长度不够
							return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127
						}
						if(byte>4)
						{
							p8Data[0]=0;
							p8Data+=1;
							LEN_Data0+=1;
							LEN_RxDataBuff-=1;
							break;
						}
						Data=MRR((u32)p8rx+offset,byte);
						if((Data&0xff)==0xff)
						{
							Data=0;
						}
						x=0;
						if(Data&(1<<((8*byte)-1)))
						{
							x=1;//负
							Data&=~(1<<((8*byte)-1));
						}
						Data=bcd_hex(Data);
						if(x)
						{//负
							Data=~Data;
							Data+=1;
						}
						p8Data[0]=DataType_double_long;
						p8Data[1]=Data>>24;
						p8Data[2]=Data>>16;
						p8Data[3]=Data>>8;
						p8Data[4]=Data>>0;
						p8Data+=5;
						LEN_Data0+=5;
						LEN_RxDataBuff-=5;
						break;
					case DataType_long_unsigned:
						if(LEN_RxDataBuff<3)
						{//缓冲长度不够
							return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127
						}
						if(byte>4)
						{
							p8Data[0]=0;
							p8Data+=1;
							LEN_Data0+=1;
							LEN_RxDataBuff-=1;
							break;
						}
						Data=MRR((u32)p8rx+offset,byte);
						if((Data&0xff)==0xff)
						{
							Data=0;
						}
						Data=bcd_hex(Data);
						p8Data[0]=DataType_long_unsigned;
						p8Data[1]=Data>>8;
						p8Data[2]=Data>>0;
						p8Data+=3;
						LEN_Data0+=3;
						LEN_RxDataBuff-=3;
						break;
					case DataType_long://对应698的数据类型
						if(LEN_RxDataBuff<3)
						{//缓冲长度不够
							return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127
						}
						if(byte>4)
						{
							p8Data[0]=0;
							p8Data+=1;
							LEN_Data0+=1;
							LEN_RxDataBuff-=1;
							break;
						}
						Data=MRR((u32)p8rx+offset,byte);
						if((Data&0xff)==0xff)
						{
							Data=0;
						}
						x=0;
						if(Data&(1<<((8*byte)-1)))
						{
							x=1;//负
							Data&=~(1<<((8*byte)-1));
						}
						Data=bcd_hex(Data);
						if(x)
						{//负
							Data=~Data;
							Data+=1;
						}
						p8Data[0]=DataType_long;
						p8Data[1]=Data>>8;
						p8Data[2]=Data>>0;
						p8Data+=3;
						LEN_Data0+=3;
						LEN_RxDataBuff-=3;
						break;
					case DataType_Data:
						//break;
					default:
						if(LEN_RxDataBuff<1)
						{//缓冲长度不够
							return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127
						}
						p8Data[0]=0;
						p8Data+=1;
						LEN_Data0+=1;
						LEN_RxDataBuff-=1;
						break;
				}
			}
			p16Data[0]=LEN_Data0;
			break;
	}
	return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127
}



















